InformationRegisters/НастройкиШаблоновHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиШаблоновHTML</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МедицинскаяШапка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентскаяШапка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСШаблонамиHTMLПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру настроек шаблонов по филиалу на указанную дату
//
// Параметры:
//  Филиал			 - СправочникСсылка.Филиалы	- филиал медицинского документа.
//  ДатаДокумента	 - Дата						- дата медицинского документа.
// 
// Возвращаемое значение:
//  Структура - Настройки шаблонов.
//
Функция ПолучитьНастройкиШаблоновHTML(ДатаДокумента, Филиал) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиШаблонов = Новый Структура("ТекстМедицинскогоЗаголовка, ТекстКлиентскогоЗаголовка, ШаблонМедицинскогоЗаголовка, ШаблонКлиентскогоЗаголовка, КешИзображений");
	СрезПоследних = РегистрыСведений.НастройкиШаблоновHTML.СрезПоследних(ДатаДокумента, Новый Структура("Филиал", Филиал));
	
	Если СрезПоследних.Количество() > 0 Тогда
		НастройкиШаблонов.ШаблонМедицинскогоЗаголовка	= СрезПоследних[0].МедицинскаяШапка;
		НастройкиШаблонов.ШаблонКлиентскогоЗаголовка	= СрезПоследних[0].КлиентскаяШапка;
		
		Шаблоны = Новый Массив;
		Шаблоны.Добавить(СрезПоследних[0].МедицинскаяШапка);
		Шаблоны.Добавить(СрезПоследних[0].КлиентскаяШапка);
		
		
		ВерсииШаблонов = ВерсионированиеШаблонов.ПолучитьТаблицуВерсийШаблонов(Шаблоны, ДатаДокумента);
		Для Каждого СтрокаВерсииШаблонов Из ВерсииШаблонов Цикл
			Если ЗначениеЗаполнено(СтрокаВерсииШаблонов.ВерсияШаблона) Тогда
				Шаблоны.Добавить(СтрокаВерсииШаблонов.ВерсияШаблона);
			КонецЕсли;
		КонецЦикла;
		
		КешИзображений = РаботаСШаблонамиHTML.ПолучитьКешИзображенийПриема(Шаблоны,, РаботаСШаблонамиHTMLКлиентСервер.ЭтоWindowsXP());
		
		НастройкиШаблонов.ТекстМедицинскогоЗаголовка = ПолучитьТекстТелаHTML(ПолучитьТекстВерсииHTML(ВерсииШаблонов, СрезПоследних[0].МедицинскаяШапка), КешИзображений);
		НастройкиШаблонов.ТекстКлиентскогоЗаголовка	 = ПолучитьТекстТелаHTML(ПолучитьТекстВерсииHTML(ВерсииШаблонов, СрезПоследних[0].КлиентскаяШапка), КешИзображений);
	КонецЕсли;
	
	Возврат НастройкиШаблонов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстТелаHTML(ТекстHTML, КешИзображений)
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTML);
	РаботаСШаблонамиHTMLКлиентСервер.ЗагрузитьИзображенияПриема(ДокументHTML, КешИзображений, Неопределено);
	Возврат РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзДокументаDOM(ДокументHTML);
	
КонецФункции

Функция ПолучитьТекстВерсииHTML(ВерсииШаблонов, ШаблонПриема)
	
	СтрокиВерсийМедицинскойШапки = ВерсииШаблонов.НайтиСтроки(Новый Структура("ШаблонПриема", ШаблонПриема));
	Если СтрокиВерсийМедицинскойШапки.Количество() = 0 Тогда
		ТекстВерсииHTML = ШаблонПриема.ТекстHTML;
	Иначе
		ТекстВерсииHTML = СтрокиВерсийМедицинскойШапки[0].ВерсияШаблона.ТекстHTML;
	КонецЕсли;
	
	Возврат ТекстВерсииHTML;
	
КонецФункции

#КонецОбласти  


//Добавлено Трунов . Обход ограничений веб клиента
Функция НормализоватьОтступыНаСервере(ИсходныйТекстHTML) Экспорт
    
    // Сюда веб-клиент будет отдавать HTML строку, 
    // здесь на сервере отработает твой оригинальный код с ПозицияВДокументеDOM
    // и вернет обратно готовую строку.
    Возврат РаботаСШаблонамиHTMLКлиентСервер.НормализоватьОтступы(ИсходныйТекстHTML);
    
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьHTMLДляОтображения(Знач ИсходныйHTML, Знач ТаблицаПараметров) Экспорт
    
    // 1. Создаем DOM на сервере из строки
    Чтение = Новый ЧтениеHTML;
    Чтение.УстановитьСтроку(ИсходныйHTML);
    Построитель = Новый ПостроительDOM;
    ДокументHTML = Построитель.Прочитать(Чтение);
    
    // 2. Вызываем вашу процедуру (она теперь тоже на сервере)
    ДобавитьКнопкиСворачиваемости(ДокументHTML, ТаблицаПараметров);
    
    // 3. Превращаем измененный DOM обратно в строку
    Запись = Новый ЗаписьHTML;
    Запись.УстановитьСтроку();
    ЗаписьDOM = Новый ЗаписьDOM;
    ЗаписьDOM.Записать(ДокументHTML, Запись);
    
    Возврат Запись.Закрыть(); // Возвращаем готовую строку на клиент
КонецФункции

Процедура ДобавитьКнопкиСворачиваемости(ДокументHTML, ТаблицаПараметров)
	
	СворачиваемыеЭлементы = Новый Массив;
	ПолучитьСворачиваемыеЭлементы(ДокументHTML.Тело, СворачиваемыеЭлементы);
	
	Для Каждого ИдентификаторЭлемента Из СворачиваемыеЭлементы Цикл
		
		Элемент = ДокументHTML.ПолучитьЭлементПоИдентификатору(ИдентификаторЭлемента);
		
		Если Элемент.Атрибуты.ПолучитьИменованныйЭлемент("data-bit-collapse").Значение = "collapse" Тогда
			
			КоличествоЗаполненныхПараметров = 0;
			ПолучитьКоличествоЗаполненныхПараметров(Элемент, ТаблицаПараметров, КоличествоЗаполненныхПараметров);
			
			Если КоличествоЗаполненныхПараметров > 0 Тогда
				Элемент.УстановитьАтрибут("data-bit-collapse", "expand");
			КонецЕсли;
		КонецЕсли;
		
		ЭлементСвернут = Элемент.Атрибуты.ПолучитьИменованныйЭлемент("data-bit-collapse").Значение = "collapse";
		ТекстКнопки = ?(ЭлементСвернут, "+", "-");
		
		Если ЭлементСвернут Тогда
			Элемент.УстановитьАтрибут("hidden", "true");
		КонецЕсли;
		
		КодКнопки = "<button id=""" + ИдентификаторЭлемента + "Button"" onclick=""elementHidden('" + ИдентификаторЭлемента + "')"">" + ТекстКнопки + "</button><br>";
		РаботаСDOMКлиентСервер.ДобавитьПроизвольныйHTMLВЭлемент(Элемент.РодительскийУзел, КодКнопки,,Элемент);
		
	КонецЦикла;
	
	Если СворачиваемыеЭлементы.Количество() > 0 Тогда
		ТекстСкрипта = 
		"<script>function elementHidden(idName) {
		|	var elem = document.getElementById(idName);
		|   var button = document.getElementById(idName+'Button');
		|   if (elem.getAttribute('data-bit-collapse') === ""collapse"") {
		|       elem.removeAttribute('hidden');
		|		elem.setAttribute('data-bit-collapse','expand');
		|       button.innerHTML = ""-"";
		|   } else {
		|       elem.setAttribute('hidden','true');
		|       elem.setAttribute('data-bit-collapse','collapse');
		|       button.innerHTML = ""+"";
		|   }
		|}</script>";
		РаботаСDOMКлиентСервер.ДобавитьПроизвольныйHTMLВЭлемент(ДокументHTML.Тело, ТекстСкрипта);
	КонецЕсли;
	
КонецПроцедуры  
Процедура ПолучитьКоличествоЗаполненныхПараметров(Документ, ТаблицаПараметров, КоличествоЗаполненныхПараметров)
	
	Если Документ.ТипУзла = ТипУзлаDOM.Элемент
		И ЗначениеЗаполнено(Документ.Идентификатор)
	Тогда
		МассивПараметров = ТаблицаПараметров.НайтиСтроки( Новый Структура("СтрокаУидПараметра", Документ.Идентификатор));
		Если МассивПараметров.Количество() > 0 Тогда
			СтрокаПараметра = МассивПараметров[0];
			Если ТипЗнч(СтрокаПараметра.Значение) = Тип("Булево") Тогда
				Если СтрокаПараметра.Значение Тогда
					КоличествоЗаполненныхПараметров = КоличествоЗаполненныхПараметров + 1;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда	
				КоличествоЗаполненныхПараметров = КоличествоЗаполненныхПараметров + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ДочернийУзел Из Документ.ДочерниеУзлы Цикл
		ПолучитьКоличествоЗаполненныхПараметров(ДочернийУзел, ТаблицаПараметров, КоличествоЗаполненныхПараметров)
	КонецЦикла;
	
КонецПроцедуры
 Функция ПолучитьСворачиваемыеЭлементы(ДокументHTML, СворачиваемыеЭлементы)
	
	Если ДокументHTML.Атрибуты <> Неопределено И ДокументHTML.Атрибуты.ПолучитьИменованныйЭлемент("data-bit-collapse") <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ДокументHTML.Идентификатор) Тогда
			ДокументHTML.УстановитьАтрибут("id", Строка(Новый УникальныйИдентификатор()));
			ДокументHTML.УстановитьАтрибутИдентификатор("id", Истина);
		КонецЕсли;
		СворачиваемыеЭлементы.Добавить(ДокументHTML.Идентификатор);
	КонецЕсли;
		
	Для Каждого ДочернийЭлемент Из ДокументHTML.ДочерниеУзлы Цикл
		ПолучитьСворачиваемыеЭлементы(ДочернийЭлемент, СворачиваемыеЭлементы)
	КонецЦикла;
	
КонецФункции


//
